## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # zentral_munki_script_check.mcs-macos-os_sshd_channel_timeout_configure will be created
  + resource "zentral_munki_script_check" "mcs-macos-os_sshd_channel_timeout_configure" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = <<-EOT
            If SSHD is enabled it _MUST_ be configured with session ChannelTime out set to 900.
            
            This will set the time out when the session is inactive.
            
            NOTE: /etc/ssh/sshd_config will be automatically modified to its original state following any update or major upgrade to the operating system.
        EOT
      + excluded_tag_ids = (known after apply)
      + expected_result  = "900"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - macOS - Configure SSHD Channel Timeout to 900"
      + source           = "/usr/sbin/sshd -G | /usr/bin/awk -F \\\"=\\\" '/channeltimeout session:*/{print $2}'"
      + tag_ids          = (known after apply)
      + type             = "ZSH_INT"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-macos-os_sshd_client_alive_count_max_configure will be created
  + resource "zentral_munki_script_check" "mcs-macos-os_sshd_client_alive_count_max_configure" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = <<-EOT
            If SSHD is enabled it _MUST_ be configured with the Client Alive Maximum Count set to 0.
            
            This will set the number of client alive messages which may be sent without the SSH server receiving any messages back from the client.  If this threshold is reached while client alive messages are being sent, the SSH server will disconnect the client, terminating the session.  The client alive messages are sent through the encrypted channel and therefore will not be spoofable.  The client alive mechanism is valuable when the client or server depend on knowing when a connection has become unresponsive.
            
            NOTE: This setting is not intended to manage idle user sessions where there is no input from the client. Its purpose is to monitor for interruptions in network connectivity and force the session to terminate after the connection appears to be broken.
            
            NOTE: /etc/ssh/sshd_config will be automatically modified to its original state following any update or major upgrade to the operating system.
        EOT
      + excluded_tag_ids = (known after apply)
      + expected_result  = "0"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - macOS - Configure SSHD ClientAliveCountMax to 0"
      + source           = "/usr/sbin/sshd -G | /usr/bin/awk '/clientalivecountmax/{print $2}'"
      + tag_ids          = (known after apply)
      + type             = "ZSH_INT"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-macos-os_sshd_client_alive_interval_configure will be created
  + resource "zentral_munki_script_check" "mcs-macos-os_sshd_client_alive_interval_configure" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = <<-EOT
            If SSHD is enabled then it _MUST_ be configured with the Client Alive Interval set to 900.
            
            Sets a timeout interval in seconds after which if no data has been received from the client, sshd(8) will send a message through the encrypted channel to request a response from the client.
            
            This setting works in conjunction with ClientAliveCountMax to determine the termination of the connection after the threshold has been reached.
            
            NOTE: This setting is not intended to manage idle user sessions where there is no input from the client. Its purpose is to monitor for interruptions in network connectivity and force the session to terminate after the connection appears to be broken.
            
            NOTE: /etc/ssh/sshd_config will be automatically modified to its original state following any update or major upgrade to the operating system.
        EOT
      + excluded_tag_ids = (known after apply)
      + expected_result  = "900"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - macOS - Configure SSHD ClientAliveInterval to 900"
      + source           = "/usr/sbin/sshd -G | /usr/bin/awk '/clientaliveinterval/{print $2}'"
      + tag_ids          = (known after apply)
      + type             = "ZSH_INT"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-macos-os_sshd_unused_connection_timeout_configure will be created
  + resource "zentral_munki_script_check" "mcs-macos-os_sshd_unused_connection_timeout_configure" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = <<-EOT
            If SSHD is enabled it _MUST_ be configured with unused connection timeout set to 900.
            
            This will set the time out when there are no open channels within an session.
            
            NOTE: /etc/ssh/sshd_config will be automatically modified to its original state following any update or major upgrade to the operating system.
        EOT
      + excluded_tag_ids = (known after apply)
      + expected_result  = "900"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - macOS - Configure SSHD Unused Connection Timeout to 900"
      + source           = "/usr/sbin/sshd -G | /usr/bin/awk '/unusedconnectiontimeout/{print $2}'"
      + tag_ids          = (known after apply)
      + type             = "ZSH_INT"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-passwordpolicy-pwpolicy_account_inactivity_enforce will be created
  + resource "zentral_munki_script_check" "mcs-passwordpolicy-pwpolicy_account_inactivity_enforce" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = <<-EOT
            The macOS _MUST_ be configured to disable accounts after 35 days of inactivity.
            
            This rule prevents malicious users from making use of unused accounts to gain access to the system while avoiding detection.
        EOT
      + excluded_tag_ids = (known after apply)
      + expected_result  = "35"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - Password Policy - Disable Accounts after 35 Days of Inactivity"
      + source           = "/usr/bin/pwpolicy -getaccountpolicies 2> /dev/null | /usr/bin/tail +2 | /usr/bin/xmllint --xpath '//dict/key[text()=\\\"policyAttributeInactiveDays\\\"]/following-sibling::integer[1]/text()' -"
      + tag_ids          = (known after apply)
      + type             = "ZSH_INT"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-passwordpolicy-pwpolicy_max_lifetime_enforce will be created
  + resource "zentral_munki_script_check" "mcs-passwordpolicy-pwpolicy_max_lifetime_enforce" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = <<-EOT
            The macOS _MUST_ be configured to enforce a maximum password lifetime limit of at least 60 days.
            
            This rule ensures that users are forced to change their passwords frequently enough to prevent malicious users from gaining and maintaining access to the system.
            
            NOTE: The guidance for password based authentication in NIST 800-53 (Rev 5) and NIST 800-63B state that complexity rules should be organizationally defined. The values defined are based off of common complexity values. But your organization may define its own password complexity rules.
        EOT
      + excluded_tag_ids = (known after apply)
      + expected_result  = "60"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - Password Policy - Restrict Maximum Password Lifetime to 60 Days"
      + source           = "/usr/bin/pwpolicy -getaccountpolicies 2> /dev/null | /usr/bin/tail +2 | /usr/bin/xmllint --xpath '//dict/key[text()=\\\"policyAttributeExpiresEveryNDays\\\"]/following-sibling::*[1]/text()' -"
      + tag_ids          = (known after apply)
      + type             = "ZSH_INT"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-systemsettings-system_settings_automatic_logout_enforce will be created
  + resource "zentral_munki_script_check" "mcs-systemsettings-system_settings_automatic_logout_enforce" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = <<-EOT
            Auto logout _MUST_ be configured to automatically terminate a user session and log out the after 86400 seconds of inactivity.
            
            NOTE:The maximum that macOS can be configured for autologoff is 86400 seconds.
            
            [IMPORTANT]
            ====
            The automatic logout may cause disruptions to an organization's workflow and/or loss of data. Information System Security Officers (ISSOs) are advised to first fully weigh the potential risks posed to their organization before opting to disable the automatic logout setting.
            ====
        EOT
      + excluded_tag_ids = (known after apply)
      + expected_result  = "86400"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - System Settings - Enforce Auto Logout After 86400 Seconds of Inactivity"
      + source           = <<-EOT
            /usr/bin/osascript -l JavaScript << EOS
            $.NSUserDefaults.alloc.initWithSuiteName('.GlobalPreferences')\
            .objectForKey('com.apple.autologout.AutoLogOutDelay').js
            EOS
        EOT
      + tag_ids          = (known after apply)
      + type             = "ZSH_INT"
      + version          = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.
```
</details>